primal_run/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

castellatedMesh true;

snap            true;

addLayers       false;

geometry
{
    motorBike.obj
    {
        type            triSurfaceMesh;
        name            motorBike;
    }
}

castellatedMeshControls
{
    maxLocalCells   100000;
    maxGlobalCells  2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 3;
    features        ( { file "motorBike.eMesh" ; level 6 ; } );
    refinementSurfaces
    {
        motorBike
        {
            level           ( 5 6 );
            patchInfo
            {
                type            wall;
                inGroups        ( motorBikeGroup );
            }
        }
    }
    resolveFeatureAngle 30;
    refinementRegions
    {
        motorBike
        {
            mode            distance;
            levels          ( ( 0.5 4 ) ( 1 3 ) ( 2 2 ) ( 4 1 ) );
        }
    }
    locationInMesh  ( 3.0001 3.0001 0.43 );
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    5;
    nSmoothInternal 5;
    tolerance       2;
    nSolveIter      100;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes   true;
    layers
    {
        "(lowerWall|motorBike).*"
        {
            nSurfaceLayers  1;
        }
    }
    expansionRatio  1;
    finalLayerThickness 0.3;
    minThickness    0.1;
    nGrow           0;
    featureAngle    60;
    slipFeatureAngle 30;
    nRelaxIter      3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals  3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter      50;
}

meshQualityControls
{
    maxNonOrtho     65;
    maxBoundarySkewness 3;
    maxInternalSkewness 2;
    maxConcave      80;
    minVol          1e-13;
    minTetQuality   -1e+30;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.02;
    minVolRatio     0.01;
    minTriangleTwist -1;
    nSmoothScale    4;
    errorReduction  0.75;
}

writeFlags      ( scalarLevels layerSets layerFields );

mergeTolerance  1e-06;


// ************************************************************************* //
